'''Задача 10: На столе лежат n монеток. Некоторые из них лежат вверх
решкой, а некоторые – гербом. Определите минимальное число
монеток, которые нужно перевернуть, чтобы все монетки были
повернуты вверх одной и той же стороной. Выведите минимальное
количество монет, которые нужно перевернуть.
5 -> 1 0 1 1 0
2
'''

monet = int(input('Колличество монеток: '))
mon1 = 0

for i in range(0,monet):
  x = int(input())
  if x != 0 and x != 1:
    print('Введите число 0 или 1')
  elif x == 0:
    mon1 += 1
print(f"Минимальное колличество {mon1}")
  
# monet = int(input('Колличество монеток: '))
# x = 0
# mon0 = 0

# while monet > 0:
#   x = int(input())
#   monet -= 1
#   if x > 1 or x < 0:
#     print('Введите число 0 или 1')
#   elif x == 0:
#     mon0 += 1

# print(mon0)