'''Задача 12: Петя и Катя – брат и сестра. Петя – студент, а Катя –
школьница. Петя помогает Кате по математике. Он задумывает два
натуральных числа X и Y (X,Y≤1000), а Катя должна их отгадать. Для
этого Петя делает две подсказки. Он называет сумму этих чисел S и их
произведение P. Помогите Кате отгадать задуманные Петей числа.
4 4 -> 2 2
5 6 -> 2 3
'''

# s = int(input('Введите первое число: '))
# p = int(input('Введите второе число: '))

# x = 1
# y = s - x

# while x < s:
#   if x * y == p:
#     print(x, y)
#     break
#   else:
#     x += 1
#     y = s - x
# else:
#   print('Невозможно найти числа')




s = int(input('Введите первое число: '))
p = int(input('Введите второе число: '))

for x in range(1, 1001):
  for y in range(1, 1001):
    if x + y == s and x * y == p:
      print(x, y)
      break
    else:
      continue
    break
else:
   print('Невозможно найти числа')
